Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningPartiallyCutsHost Property
 Opening partially cuts its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningPartiallyCutsHost { get; }
Public Shared ReadOnly Property OpeningPartiallyCutsHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningPartiallyCutsHost {
	FailureDefinitionId^ get ();
}
static member OpeningPartiallyCutsHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace